package lessons.lesson09.homeworks

fun main() {


//Работа с массивами Array
// 1. Создайте массив из 5 целых чисел и инициализируйте его значениями от 1 до 5.
    val array1 = arrayOf(1, 2, 3, 4, 5)
// 2. Создайте пустой массив строк размером 10 элементов.
    val array2 = Array(10) { "" }
// 3. Создайте массив из 5 элементов типа Double и заполните его значениями, являющимися удвоенным индексом элемента.


// 4. Создайте массив из 5 элементов типа Int. Используйте цикл, чтобы присвоить каждому элементу значение, равное его индексу, умноженному на 3.
// 5. Создайте массив из 3 nullable строк. Инициализируйте его одним null значением и двумя строками.
// 6. Создайте массив целых чисел и скопируйте его в новый массив в цикле.
// 7. Создайте два массива целых чисел одинаковой длины. Создайте третий массив, вычев значения одного из другого. Распечатайте полученные значения.
// 8. Создайте массив целых чисел. Найдите индекс элемента со значением 5. Если значения 5 нет в массиве, печатаем -1. Реши задачу через цикл while.
// 9. Создайте массив целых чисел. Используйте цикл для перебора массива и вывода каждого элемента в консоль. Напротив каждого элемента должно быть написано “чётное” или “нечётное”.
// 10. Создай функцию, которая принимает массив строк и строку для поиска. Функция должна находить в массиве элемент, в котором принятая строка является подстрокой (метод contains()). Распечатай найденный элемент.


}